{"pageProps":{"postData":{"id":"blogging","contentHtml":"<p class=\"drac-text drac-line-height drac-text-white\">Hello and welcome to my blog! I hope that you enjoy your stay here!</p>\n<p class=\"drac-text drac-line-height drac-text-white\">So a quick explaination as to why have a blog. I have been working on a few different projects and I decided that this would be the best way to talk about my projects and how I'm progressing. Despite this being the main reason, I'm going to also discuss other things about my life and causes that mean a lot to me. This will also include a post about <em>pride</em> later in this month.</p>\n<h2 class=\"drac-heading drac-heading-xl drac-text-white\">Life?</h2>\n<p class=\"drac-text drac-line-height drac-text-white\">So for those of you who don't know, Ludoviko isn't my legal name. I don't feel comfortable with the entire world knowing my full identity. Which poses the question as to how I'll talk about life. I'm planning to do this by excluding anything that could identify me unless extremely necessary. This should allow you to get a good grasp as to who I am as a person, while allowing me to keep a certain amount of anonymity.</p>\n<h2 class=\"drac-heading drac-heading-xl drac-text-white\">Comments?</h2>\n<p class=\"drac-text drac-line-height drac-text-white\">So I'm working on adding a comments system to this blog using <a href=\"https://cactus.chat\" class=\"drac-anchor drac-text drac-text-purple drac-text-pink--hover drac-mb-sm\" target=\"_blank\" rel=\"noopener noreferrer\">Cactus Comments</a>. The scripts for this are already on this page, it just won't load as I'm typing this but that could be because of issues with localhost. This comments system is built on top of the <a href=\"https://matrix.org\" class=\"drac-anchor drac-text drac-text-purple drac-text-pink--hover drac-mb-sm\" target=\"_blank\" rel=\"noopener noreferrer\">[matrix]</a> protocol. I do host a homeserver for [matrix] but the cactus comments works on their homeserver at the moment. You can send comments as anonymously as you like (just set your name to whatever you like). You do not need to sign in to comment, just type a message and a name then hit the post button! Feel free to join me on [matrix] though! My hosted webclient is available <a href=\"https://chat.saluton.cc\" class=\"drac-anchor drac-text drac-text-purple drac-text-pink--hover drac-mb-sm\" target=\"_blank\" rel=\"noopener noreferrer\">here</a> but you can also use any compatible client! My username is <a href=\"https://matrix.to/#/@ludoviko:saluton.cc\" class=\"drac-anchor drac-text drac-text-purple drac-text-pink--hover drac-mb-sm\" target=\"_blank\" rel=\"noopener noreferrer\">@ludoviko:saluton.cc</a>.</p>\n<h2 class=\"drac-heading drac-heading-xl drac-text-white\">Not so final words?</h2>\n<p class=\"drac-text drac-line-height drac-text-white\">I am looking at improving my website in the future, which will include a complete restart. This includes an improvement to this blog to possibly include RSS/Atom feeds in the future!</p>\n<p class=\"drac-text drac-line-height drac-text-white\">Until next time!</p>\n<p class=\"drac-text drac-line-height drac-text-white\">Kun espero,<br>\nLudoviko</p>\n","title":"Blogging?","date":"2021-06-01","description":"The first post.","keywords":"Ludoviko, blog, comments, welcome"}},"__N_SSG":true}